{"pageProps":{"posts":[{"id":"2022-07-31-reminders-software-engineering-journey","meta":{"title":"3 reminders when starting a Software Engineering journey","date":"2022-07-31","coverImage":"https://images.unsplash.com/photo-1656444698971-5eed37d977c7?ixlib=rb-1.2.1&dl=meagan-feddersen-AYKuGNzWJns-unsplash.jpg&w=1920&q=80&fm=jpg&crop=entropy&cs=tinysrgb","coverImageCaption":"Photo by [Meagan Feddersen](https://unsplash.com/@meaganfedds) on Unsplash","tags":["career","software-engineering"]},"content":"\nStarting a new software engineering role can get a little overwhelming at a new place. As I navigated through my new role in the past months, I was reminded that as much as I observe the work culture, processes and team in my new position, I'm more of a participant than an observer.\n\nThese are 3 things that can be of helpful reminder for anyone starting out.\n\n## 1. Ask questions, often\n\nWhether it's day 1 or 3 years in, communication is key to alignment and understanding.\n\nIt's often that we don't ask questions out of fear of asking a \"wrong\" or \"stupid\" question, but it shouldn't be the way. I think it is okay to just ask, clarify and understand. That way as you go along, you learn how to ask better questions that can (1) put you and your team on track, (2) navigate you and your team around potential roadblocks, and (3) help you deepen your understanding of the value and meaning of your contribution. \n\nIt's way better to ask a \"wrong\" or \"stupid\" question than to be a muted team member, because being muted no one else will know what you know. Silence doesn't always mean alignment. \n\nIf you find yourself in a place where you're often condemned for asking a \"wrong\" or \"stupid\" questions, you might want to consider if the environment you're in is helping you grow. \n\nYou might want to find out what's a good way to ask your question, whether synchronously in a Zoom call, asynchronously on the meeting chat, in a 1:1 direct message, or asking it in an open space like wiki comments. \n\n## 2. Get involved, early\n\nThere are opportunities for growth for you when you get involved. You get to learn and hone both technical skills and soft skills when you do this.\n\nFor example, as a junior software engineer, if you're assigned a project to build a backend software system, there are several benefits of getting involved early with:\n\n- you can shadow your lead / principal software engineer on the system design and pick up after them on the good stuff\n- you can learn about the problem domain better, what are the business / product requirements, how are they derived etc. in turn this helps provide meaning and context to your contributions\n\n## 3. Close the feedback loop\n\nWords matter, a lot. \n\nAs much as you want to feel appreciated for your work from peers and leads, you can take the first step to thank others every step of the way. For a peer who has gone out of their way to help or guide you, you can:\n\n- Leave a thank you message to appreciate them\n- Treat them to coffee\n\nIt cost nothing to say thanks genuinely and to play a part in building a positive work environment.\n\n<div style=\"width:100%;height:0;padding-bottom:56%;position:relative;\"><iframe src=\"https://giphy.com/embed/xZxtYEV4GHQtgccxIl\" width=\"100%\" height=\"100%\" style=\"position:absolute\" frameBorder=\"0\" class=\"giphy-embed\" allowFullScreen></iframe></div><p><a href=\"https://giphy.com/gifs/TheSwoon-netflix-swoon-theswoon-xZxtYEV4GHQtgccxIl\">via GIPHY</a></p>\n\nAll the best in your journey too. Check out the additional resources:\n\n- [Top 10 pieces of advice for rookie software engineers](https://medium.com/singapore-gds/top-10-pieces-of-advice-for-rookie-software-engineer-f1a2b38f1d56)","prevId":"2022-05-12-backend-power-on-self-test"}],"tag":"software-engineering"},"__N_SSG":true}